---
title: FabricationPartType
classe: Autodesk.Revit.DB.FabricationPartType
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# FabricationPartType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FabricationPartType Create(Document, FabricationServiceButton, Int32)` | `FabricationPartType.Create(document, button, condition)` | FabricationPartType |
| `ElementId Lookup(Document, FabricationServiceButton, Int32)` | `FabricationPartType.Lookup(document, button, condition)` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```